export const users = [
    {
        id: "u1",
        name: "Вася Пупкін",
        avatarUrl: "",
        course: "Математика інтенсив",
        progress: "12 з 20 уроків (60%)",
        lastTest: "Результат останнього тесту: 8/10",
        payment: "Оплачено",
        teacherComment: "Потребує додаткової уваги при підготовці до тесту №2",
        comments: [
            {
                id: "c1",
                course: "Математика інтенсив",
                text: "Курс сподобався, пояснення доступні.",
                createdAt: "2025-02-01T12:15:00Z",
            },
            {
                id: "c2",
                course: "Математика інтенсив",
                text: "Хотілося б більше задач з відповідями.",
                createdAt: "2025-02-10T08:30:00Z",
            },
        ],
    },
    {
        id: "u2",
        name: "Вася Пупкін2",
        avatarUrl: "",
        course: "Історія України",
        progress: "5 з 14 уроків (36%)",
        lastTest: "Останній тест: 6/10",
        payment: "Не оплачено",
        teacherComment: "Рекомендується повторити тему «Київська Русь».",
        comments: [
            {
                id: "c3",
                course: "Історія України",
                text: "Цікаві приклади, але мало візуалізацій.",
                createdAt: "2025-01-29T10:00:00Z",
            },
        ],
    },
    {
        id: "u3",
        name: "Вася Пупкін3",
        avatarUrl: "",
        course: "Українська мова",
        progress: "3 з 10 уроків (30%)",
        lastTest: "Останній тест: 7/10",
        payment: "Оплачено",
        teacherComment: "Працювати над орфографією, зробити конспект.",
        comments: [
            {
                id: "c4",
                course: "Українська мова",
                text: "Дуже допомогло пояснення відмінків.",
                createdAt: "2025-02-12T17:40:00Z",
            },
        ],
    },
];
